luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_regdef.h
/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_ACCEN1_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_ACCEN1;

/** \brief  CAN Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_CLC_Bits B;                     /**< \brief Bitfield access */
} Ifx_CAN_CLC;

/** \brief  CAN Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_FDR_Bits B;                     /**< \brief Bitfield access */
} Ifx_CAN_FDR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_CAN_ID;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_KRST0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_KRST1_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_KRSTCLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CAN_KRSTCLR;

/** \brief  List Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_LIST_Bits B;                    /**< \brief Bitfield access */
} Ifx_CAN_LIST;

/** \brief  Module Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MCR_Bits B;                     /**< \brief Bitfield access */
} Ifx_CAN_MCR;

/** \brief  Measurement Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MECR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CAN_MECR;

/** \brief  Measurement Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MESTAT_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_MESTAT;

/** \brief  Module Interrupt Trigger Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MITR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CAN_MITR;

/** \brief  Message Object  Acceptance Mask Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_AMR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_MO_AMR;

/** \brief  Message Object  Arbitration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_AR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_MO_AR;

/** \brief  Message Object  Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_CTR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_MO_CTR;

/** \brief  Message Object  Data Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_DATAH_Bits B;                /**< \brief Bitfield access */
} Ifx_CAN_MO_DATAH;

/** \brief  Message Object  Data Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_DATAL_Bits B;                /**< \brief Bitfield access */
} Ifx_CAN_MO_DATAL;

/** \brief  Extended Message Object  Data 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_EDATA0_Bits B;               /**< \brief Bitfield access */
} Ifx_CAN_MO_EDATA0;

/** \brief  Extended Message Object  Data 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_EDATA1_Bits B;               /**< \brief Bitfield access */
} Ifx_CAN_MO_EDATA1;

/** \brief  Extended Message Object  Data 2 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_EDATA2_Bits B;               /**< \brief Bitfield access */
} Ifx_CAN_MO_EDATA2;

